# 1. Data Preprocessing for Genre Normalization

In [15]:
# Libraries
import pandas as pd

In [16]:
basics = pd.read_csv(r'Data\title_basics.csv.gz')

In [17]:
# Renaming for easier coding
df = basics
df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016.0,NaN,90,Drama
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
4,tt0082328,movie,Embodiment of Evil,Encarnação do Demônio,0,2008.0,NaN,94,Horror

In [18]:
# Split genres into lists and explode immediately
df_exploded = df.assign(genres_split=df['genres'].str.split(',')).explode('genres_split')

In [19]:
# Get unique genres
unique_genres = sorted(df_exploded['genres_split'].unique())

In [20]:
# Mapping genres to integers
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))

In [21]:
# Create genre_id in the exploded dataframe
df_exploded['genre_id'] = df_exploded['genres_split'].map(genre_map)
title_genres = df_exploded[['tconst', 'genre_id']].drop_duplicates()

df_exploded.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split,genre_id
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy,5
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy,9
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance,18
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,Drama,7
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016.0,NaN,90,Drama,Drama,7

In [22]:
basics['genres_split'] = basics['genres'].str.split(',')
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,[Drama]
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016.0,NaN,90,Drama,[Drama]
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,[Drama]
4,tt0082328,movie,Embodiment of Evil,Encarnação do Demônio,0,2008.0,NaN,94,Horror,[Horror]
...,...,...,...,...,...,...,...,...,...,...
138496,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
138497,tt9916270,movie,Il talento del calabrone,Il talento del calabrone,0,2020.0,NaN,84,Thriller,[Thriller]
138498,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History","[Drama, History]"
138499,tt9916538,movie,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,0,2019.0,NaN,123,Drama,[Drama]
138500,tt9916730,movie,6 Gunn,6 Gunn,0,2017.0,NaN,116,Drama,[Drama]

In [23]:
exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,Drama
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016.0,NaN,90,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
138497,tt9916270,movie,Il talento del calabrone,Il talento del calabrone,0,2020.0,NaN,84,Thriller,Thriller
138498,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",Drama
138498,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",History
138499,tt9916538,movie,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,0,2019.0,NaN,123,Drama,Drama
138500,tt9916730,movie,6 Gunn,6 Gunn,0,2017.0,NaN,116,Drama,Drama

In [24]:
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0068865        Drama

In [25]:
# Creating genres dataframe
genres = pd.DataFrame({
    'genre_id': genre_ints,
    'genre_name': unique_genres
})

# 2. Data Preprocessing for Discarding Unnecessary Information

In [26]:
df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,[Drama]
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016.0,NaN,90,Drama,[Drama]
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,[Drama]
4,tt0082328,movie,Embodiment of Evil,Encarnação do Demônio,0,2008.0,NaN,94,Horror,[Horror]

In [27]:
# Drop columns from title basics
cols_to_drop = ["originalTitle", "isAdult", "titleType", "genres"]
df.drop(columns=cols_to_drop, inplace=True)

In [28]:
df.head()

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres_split
0,tt0035423,Kate & Leopold,2001.0,NaN,118,"[Comedy, Fantasy, Romance]"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,NaN,70,[Drama]
2,tt0068865,Lives of Performers,2016.0,NaN,90,[Drama]
3,tt0069049,The Other Side of the Wind,2018.0,NaN,122,[Drama]
4,tt0082328,Embodiment of Evil,2008.0,NaN,94,[Horror]

# 3. MySQL Database Operations

## 1. Setting up the environment:

In [29]:
from sqlalchemy import create_engine, String, Text, Float, Integer

## 2. Connect to MySQL and Create a New Database:

In [30]:
from sqlalchemy import create_engine, exc

# Connect to MySQL server without specifying the database
DATABASE_URL = "mysql+mysqldb://root:root@localhost"
engine = create_engine(DATABASE_URL)

# Try creating the database
try:
    engine.execute("CREATE DATABASE movies;")
    print("Database 'movies' created successfully.")
except exc.SQLAlchemyError as e:
    print(f"Error: {str(e)}")

Error: (MySQLdb.ProgrammingError) (1007, "Can't create database 'movies'; database exists")
[SQL: CREATE DATABASE movies;]
(Background on this error at: https://sqlalche.me/e/14/f405)

## 3. Reconnect to the newly created database:

In [31]:
DATABASE_URL = "mysql+mysqldb://root:root@localhost/movies"
engine = create_engine(DATABASE_URL)

In [32]:
key_len = df['tconst'].fillna('').map(len).max()
title_len = df['primaryTitle'].fillna('').map(len).max()

df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

## 4. Save DataFrames to SQL:

In [33]:
# Importing title_ratings

# Path to file
file_path = "G:\\Github Desktop Reps\\Coding Dojo\\Project-3\\Data\\title.ratings.tsv.gz"

# Load the compressed TSV file into a pandas DataFrame
title_ratings_df = pd.read_csv(file_path, sep='\t', compression='gzip')

title_ratings_df.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1994
1  tt0000002            5.8       268
2  tt0000003            6.5      1883
3  tt0000004            5.5       177
4  tt0000005            6.2      2667

In [34]:
# Importing tmdb_df

# Paths to files
file_path_2000 = "G:\\Github Desktop Reps\\Coding Dojo\\Project-3\\Data\\final_tmdb_data_for_2000.csv.gz"
file_path_2001 = "G:\\Github Desktop Reps\\Coding Dojo\\Project-3\\Data\\final_tmdb_data_for_2001.csv.gz"

# Load the compressed CSV files into pandas DataFrames
data_2000 = pd.read_csv(file_path_2000, compression='gzip')
data_2001 = pd.read_csv(file_path_2001, compression='gzip')

# Concatenate the two DataFrames
tmdb_df = pd.concat([data_2000, data_2001], ignore_index=True)

tmdb_df.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.50,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.45,10.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.00,1.0,NaN
4,tt0116748,0.0,/wr0hTHwkYIRC82MwNbhOvqrw27N.jpg,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,579396.0,hi,Karobaar,...,0.0,180.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,The Business of Love,Karobaar,0.0,7.00,3.0,NaN

In [ ]:
# Saving the tables to the database (ensure correct dtypes/schema for each)
df.to_sql('title_basics', engine, if_exists='replace', index=False)
title_ratings_df.to_sql('title_ratings', engine, if_exists='replace', index=False)
title_genres.to_sql('title_genres', engine, if_exists='replace', index=False)
genres.to_sql('genres', engine, if_exists='replace', index=False)
tmdb_df.to_sql('tmdb_data', engine, if_exists='replace', index=False)

In [ ]:
# Set primary keys for tables
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [37]:
result = engine.execute("SHOW INDEX FROM title_basics WHERE Key_name = 'PRIMARY';")
for row in result:
    print(row)

In [ ]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [39]:
result = engine.execute("SHOW INDEX FROM title_ratings WHERE Key_name = 'PRIMARY';")
for row in result:
    print(row)

In [40]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`id`);')

In [41]:
result = engine.execute('SELECT COUNT(*) FROM tmdb_data WHERE id IS NULL;')
count_null_ids = result.fetchone()[0]
print(f"Number of NULL values in 'id' column: {count_null_ids}")

Number of NULL values in 'id' column: 0

In [42]:
new_id = -1
for _ in range(2):  # Since there are 2 NULL values
    engine.execute(f'UPDATE tmdb_data SET id = {new_id} WHERE id IS NULL LIMIT 1;')
    new_id -= 1

In [ ]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`id`);')

In [45]:
result = engine.execute('DESCRIBE tmdb_data;')
for row in result:
    print(row)

('imdb_id', 'text', 'YES', '', None, '')
('adult', 'double', 'YES', '', None, '')
('backdrop_path', 'text', 'YES', '', None, '')
('belongs_to_collection', 'text', 'YES', '', None, '')
('budget', 'double', 'YES', '', None, '')
('genres', 'text', 'YES', '', None, '')
('homepage', 'text', 'YES', '', None, '')
('id', 'double', 'NO', 'PRI', None, '')
('original_language', 'text', 'YES', '', None, '')
('original_title', 'text', 'YES', '', None, '')
('overview', 'text', 'YES', '', None, '')
('popularity', 'double', 'YES', '', None, '')
('poster_path', 'text', 'YES', '', None, '')
('production_companies', 'text', 'YES', '', None, '')
('production_countries', 'text', 'YES', '', None, '')
('release_date', 'text', 'YES', '', None, '')
('revenue', 'double', 'YES', '', None, '')
('runtime', 'double', 'YES', '', None, '')
('spoken_languages', 'text', 'YES', '', None, '')
('status', 'text', 'YES', '', None, '')
('tagline', 'text', 'YES', '', None, '')
('title', 'text', 'YES', '', None, '')
('video', 'double', 'YES', '', None, '')
('vote_average', 'double', 'YES', '', None, '')
('vote_count', 'double', 'YES', '', None, '')
('certification', 'text', 'YES', '', None, '')

In [46]:
result = engine.execute("SHOW INDEX FROM tmdb_data WHERE Key_name = 'PRIMARY';")
for row in result:
    print(row)

('tmdb_data', 0, 'PRIMARY', 1, 'id', 'A', 4231, None, None, '', 'BTREE', '', '', 'YES', None)

### Adjusting the Saving DataFrames to SQL Steps:

In [47]:
# Saving the tables to the database (ensure correct dtypes/schema for each)

# df.to_sql('title_basics', engine, if_exists='replace', index=False)
# title_genres.to_sql('title_genres', engine, if_exists='replace', index=False)
# genres.to_sql('genres', engine, if_exists='replace', index=False)

# Set primary key for tables

# engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [48]:
tables = ['title_basics', 'title_genres', 'genres']
for table in tables:
    result = engine.execute(f"SELECT * FROM {table} LIMIT 5;")
    print(f"Table: {table}")
    for row in result:
        print(row)
    print("\n")

Table: title_basics


Table: title_genres
('tt0035423', 5)
('tt0035423', 9)
('tt0035423', 18)
('tt0062336', 7)
('tt0068865', 7)


Table: genres
(0, 'Action')
(1, 'Adult')
(2, 'Adventure')
(3, 'Animation')
(4, 'Biography')

## 5. Display the First 5 Rows for Each Table:

In [49]:
tables = ['title_basics', 'title_ratings', 'title_genres', 'genres', 'tmdb_data']
for table in tables:
    result = engine.execute(f"SELECT * FROM {table} LIMIT 5;")
    print(f"Table: {table}")
    for row in result:
        print(row)
    print("\n")

Table: title_basics


Table: title_ratings
('tt0000001', 5.7, 1994)
('tt0000002', 5.8, 268)
('tt0000003', 6.5, 1883)
('tt0000004', 5.5, 177)
('tt0000005', 6.2, 2667)


Table: title_genres
('tt0035423', 5)
('tt0035423', 9)
('tt0035423', 18)
('tt0062336', 7)
('tt0068865', 7)


Table: genres
(0, 'Action')
(1, 'Adult')
(2, 'Adventure')
(3, 'Animation')
(4, 'Biography')


Table: tmdb_data
('0', None, None, None, None, None, None, -2.0, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None)
('0', None, None, None, None, None, None, -1.0, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None)
('tt0168629', 0.0, '/gs70htixF6j1oqrrwsM4lVfcgNN.jpg', None, 12800000.0, "[{'id': 18, 'name': 'Drama'}, {'id': 80, 'name': 'Crime'}]", None, 16.0, 'en', 'Dancer in the Dark', "Selma, a Czech immigrant on the verge of blindness, struggles to make ends meet for herself and her son, who has inherited the same genetic disorder  ... (121 characters truncated) ... her love of musicals, escaping life's troubles - even if just for a moment - by dreaming up little numbers to the rhythmic beats of her surroundings.", 16.285, '/8Wdd3fQfbbQeoSfWpHrDfaFNhBU.jpg', "[{'id': 53671, 'logo_path': None, 'name': 'Lantia Cinema & Audiovisivi', 'origin_country': ''}, {'id': 8, 'logo_path': '/78ilmDNTpdCfsakrsLqmAUkFTrO. ... (2293 characters truncated) ... me': 'Constantin Film', 'origin_country': 'DE'}, {'id': 239, 'logo_path': '/96hCWEsfmTZQsoUap0CcG21qaA.png', 'name': 'VPRO', 'origin_country': 'NL'}]", "[{'iso_3166_1': 'AR', 'name': 'Argentina'}, {'iso_3166_1': 'DK', 'name': 'Denmark'}, {'iso_3166_1': 'FI', 'name': 'Finland'}, {'iso_3166_1': 'FR', 'n ... (219 characters truncated) ... '}, {'iso_3166_1': 'SE', 'name': 'Sweden'}, {'iso_3166_1': 'GB', 'name': 'United Kingdom'}, {'iso_3166_1': 'US', 'name': 'United States of America'}]", '2000-06-30', 40031879.0, 141.0, "[{'english_name': 'English', 'iso_639_1': 'en', 'name': 'English'}]", 'Released', "You don't need eyes to see.", 'Dancer in the Dark', 0.0, 7.87, 1620.0, 'R')
('tt0245712', 0.0, '/qNQOEzm6xJ2hgWDImzkIox27aiV.jpg', None, 2000000.0, "[{'id': 18, 'name': 'Drama'}, {'id': 53, 'name': 'Thriller'}]", None, 55.0, 'es', 'Amores perros', 'A fatalistic car crash in Mexico city sets off a chain of events in the lives of three people: a supermodel, a young man wanting to run off with his  ... (1 characters truncated) ... ister-in-law, and a homeless man. Their lives are catapulted into unforeseen situations instigated by the seemingly inconsequential destiny of a dog.', 26.408, '/vV4vlD4ool5JSsS1rB82qjCF6z8.jpg', "[{'id': 5084, 'logo_path': None, 'name': 'Altavista Films', 'origin_country': 'MX'}, {'id': 110056, 'logo_path': None, 'name': 'Zeta Film (MX)', 'origin_country': 'MX'}]", "[{'iso_3166_1': 'MX', 'name': 'Mexico'}]", '2000-06-16', 20908467.0, 154.0, "[{'english_name': 'Spanish', 'iso_639_1': 'es', 'name': 'Español'}]", 'Released', 'Love. Betrayal. Death.', 'Amores Perros', 0.0, 7.627, 2341.0, 'R')
('tt0249462', 0.0, '/urzflyf41uySpgciGHdQzpcaMOY.jpg', None, 5000000.0, "[{'id': 18, 'name': 'Drama'}, {'id': 35, 'name': 'Comedy'}, {'id': 10402, 'name': 'Music'}]", None, 71.0, 'en', 'Billy Elliot', "County Durham England 1984 the miners strike has started and the police have started coming up from Bethnal Green starting a class war with the lower ... (200 characters truncated) ... d. He practices with his teacher Mrs Wilkinson for an upcoming audition in Newcastle-upon Tyne the audition is for the royal Ballet school in London.", 21.269, '/nOr5diUZxphmAD3li9aiILyI28F.jpg', "[{'id': 694, 'logo_path': '/5LEHONGkZBIoWvp1ygHOF8iyi1M.png', 'name': 'StudioCanal', 'origin_country': 'FR'}, {'id': 288, 'logo_path': '/aW0IpM9d4Zjj ... (549 characters truncated) ... eatures', 'origin_country': 'US'}, {'id': 33, 'logo_path': '/8lvHyhjr8oUKOOy2dKXoALWKdp0.png', 'name': 'Universal Pictures', 'origin_country': 'US'}]", "[{'iso_3166_1': 'FR', 'name': 'France'}, {'iso_3166_1': 'GB', 'name': 'United Kingdom'}, {'iso_3166_1': 'US', 'name': 'United States of America'}]", '2000-09-28', 109280263.0, 110.0, "[{'english_name': 'English', 'iso_639_1': 'en', 'name': 'English'}]", 'Released', 'Inside every one of us is a special talent waiting to come out. The trick is finding it.', 'Billy Elliot', 0.0, 7.593, 3564.0, 'PG-13')

## 6. Display the List of Tables:

In [50]:
result = engine.execute("SHOW TABLES;")
print("Tables in 'movies' database:")
for row in result:
    print(row[0])

Tables in 'movies' database:
genres
title_basics
title_genres
title_ratings
tmdb_data